cask "iterm2"
brew "chezmoi"
brew "vivid"
brew "git"
brew "jj"
brew "tig"
brew "serie"
brew "git-cliff"
brew "git-sizer"
brew "pre-commit"
brew "fzf"
brew "sk"
brew "bfs"
brew "fd"
brew "ripgrep"
brew "bat"
brew "tokei"
brew "zellij"
brew "tmux"
brew "jq"
brew "jless"
brew "jaq"
brew "yq"
brew "fx"
brew "telnet"
brew "watch"
brew "tree"
brew "dos2unix"
brew "dateutils"
brew "ipcalc"
brew "bcal"
brew "hyperfine"
brew "coreutils"
brew "wget"
brew "gnu-sed"
brew "zoxide"
brew "yazi"
brew "btop"
brew "just"

brew "mise"
brew "uv"
brew "rustup"

brew "gnupg"

cask "1password"
cask "1password-cli"
cask "visual-studio-code"

# AWS
brew "awscli"
cask "session-manager-plugin"
tap "common-fate/granted"
brew "granted"
tap "aws/tap"
brew "ec2-instance-selector"
tap "lucagrulla/tap"
brew "cw"

# Terraform
# brew "atmos"
brew "terraform-docs"
brew "tfsec"
brew "tflint"
brew "tfmigrate"
brew "terramate"
brew "terragrunt"
tap "busser/tap"
brew "tfautomv"
tap "warrensbox/tap"
brew "tfswitch"

# Neovim
brew "neovim"
# Astronvim deps
brew "tree-sitter"
brew "ripgrep"
brew "lazygit"
# conflicts with coreutils du (gdu) ?
brew "gdu"
brew "bottom"
brew "viu"

cask "firefox"
cask "vitals"
cask "slack"
cask "zoom"


# ZED
cask "zed"
brew "shellcheck"
brew "shfmt"


cask "android-studio"

brew "lima"
brew "colima"
# Required for colima
brew "docker"
brew "docker-buildx"
brew "docker-compose"


# Kubernetes
brew "k3d"
brew "helm"
brew "kubectx"
brew "k9s"
brew "yamllint"


brew "ykman"
cask "yubico-authenticator"
brew "pinentry-mac"
brew "openssh"


# Grafana stack
brew "logcli"
brew "jsonnet"
brew "jsonnet-bundler"


# Fonts
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-m+-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-inter"
