cask "ghostty"
cask "kitty"
brew "chezmoi"
brew "vivid"
brew "jj"
brew "git"
brew "git-filter-repo"
brew "cocogitto"
brew "git-cliff"
brew "tig"
brew "git-cliff"
brew "git-sizer"
brew "pre-commit"
brew "fzf"
brew "bfs"
brew "fd"
brew "ripgrep"
brew "bat"
brew "tokei"
brew "zellij"
brew "tmux"
brew "jq"
brew "jless"
brew "jaq"
brew "yq"
brew "fx"
brew "telnet"
brew "watch"
brew "tree"
brew "dos2unix"
brew "dateutils"
brew "ipcalc"
brew "bcal"
brew "hyperfine"
brew "coreutils"
brew "wget"
brew "gnu-sed"
brew "zoxide"
brew "yazi"
brew "btop"
brew "just"
brew "miniserve"
brew "certigo"
brew "boxes"
brew "goaccess"

brew "mise"
brew "rustup"

brew "gnupg"

cask "1password"
cask "1password-cli"
cask "visual-studio-code"

# AWS
brew "awscli"
cask "session-manager-plugin"
brew "aws-sso-cli"
tap "aws/tap"
brew "ec2-instance-selector"
tap "lucagrulla/tap"
brew "cw"
tap "keidarcy/tap"
brew "e1s"

# Terraform
brew "tenv"
brew "terraform-docs"
brew "trivy"
brew "tflint"
brew "tfmigrate"
brew "hcl2json"

# Neovim
brew "neovim"
# Astronvim deps
brew "tree-sitter-cli"
brew "ripgrep"
brew "lazygit"
# conflicts with coreutils du (gdu) ?
brew "gdu"
brew "bottom"
brew "viu"
brew "ast-grep"
brew "imagemagick"

cask "vitals"
cask "zoom"


# ZED
cask "zed"
brew "shellcheck"
brew "shfmt"
tap "alesbrelih/gitlab-ci-ls"
brew "gitlab-ci-ls"


cask "android-studio"
brew "gradle-profiler"

brew "colima"
# Required for colima
brew "docker"
brew "docker-buildx"
brew "docker-compose"


# Kubernetes
brew "k3d"
brew "helm"
brew "kubectx"
brew "k9s"
cask "headlamp"
brew "yamllint"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"


brew "ykman"
cask "yubico-authenticator"
brew "pinentry-mac"
brew "openssh"


# Grafana stack
brew "logcli"
brew "jsonnet"
brew "jsonnet-bundler"


# Fonts
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-inter"
