# brew "chezmoi"
# brew "antidote"
brew "mtr"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "git"
brew "git-sizer"
brew "pre-commit"
brew "tig"
brew "jq"
brew "jaq"
brew "yq"
brew "fx"
brew "gnu-sed"
brew "gnu-tar"
# brew "ranger"
brew "cloc"
brew "telnet"
brew "watch"
brew "tree"
brew "bat"
brew "dos2unix"
brew "grep"
brew "tmux"
# brew "gh"
# brew "act"
# brew "actionlint"
brew "coreutils"
brew "dateutils"
brew "ipcalc"
brew "bcal"
# brew "mysql-client"
# brew "mydumper"
# brew "percona-toolkit"
# brew "libpq"
brew "neovim"
brew "tree-sitter"
brew "lazygit"
# conflicts with coreutils
# brew "gdu"
brew "bottom"
# brew "awscli"
# brew "cli53"
# brew "chamber"
# tap "aws/tap"
# brew "ec2-instance-selector"
# brew "cloud-nuke"
# brew "wrk"
# brew "locust"
brew "k6"
brew "ncdu"
brew "gopass"
brew "gnupg"
brew "pinentry-mac"
brew "shellcheck"
brew "go"
brew "gopls"
brew "delve"
brew "staticcheck"
brew "zig"
# brew "python"
# brew "pipx"
# brew "black"
# brew "mkcert"
brew "vivid"
brew "starship"
brew "curl"
brew "hyperfine"
brew "minio-mc"
brew "pdsh"

brew "autoconf"
brew "automake"
brew "libtool"

# vm on m1
# cask "utm"

# tap "buildpacks/tap"
# brew "pack"

# cask "redisinsight"

# tap "shivammathur/php"
# brew "shivammathur/php/php@5.6"

# brew "protobuf"
# brew "protoc-gen-go"
# tap "bufbuild/buf"
# brew "buf"

# brew "csvkit"
# brew "gdal"

# tap "ddosify/tap"
# brew "ddosify"
# brew "jmeter"
# brew "locust"

# tap "lucagrulla/tap"
# brew "cw"

tap "homebrew/cask-versions"
cask "zulu8"
cask "zulu11"
cask "zulu17"
# brew "ktlint"

# cask "jdk-mission-control"

brew "mise"
# brew "volta"
# brew "atlas"

tap "danielfoehrkn/switch"
brew "switcher"
brew "switch"

# brew "kubernetes-cli"
brew "krew"
brew "k3d"
brew "helm"
brew "chart-testing"
brew "kubectx"
brew "k9s"
brew "kubent"
brew "pluto"
# brew "kubie"

tap "utkuozdemir/pv-migrate"
brew "pv-migrate"

tap "robusta-dev/homebrew-krr"
brew "krr"

brew "kubeseal"
brew "tfk8s"
brew "kustomize"
brew "kube-linter"
brew "yamllint"
brew "argocd"
# brew "istioctl"
# cask "openlens"
brew "cilium-cli"
brew "hubble"
brew "logcli"
brew "vault"

tap "norwoodj/tap"
brew "helm-docs"

# cask "google-cloud-sdk"
# brew "crane"

# Using local build until https://github.com/GoogleCloudPlatform/terraformer/issues/880 is fixed
# brew "terraformer"
# brew "terracognita"


# tap "warrensbox/tap"
# brew "tfswitch"


tap "busser/tap"
brew "tfautomv"

brew "terraform-docs"
brew "tfsec"
brew "tflint"
brew "tfmigrate"

# brew "pulumi"

# cask "slack"
cask "kitty"
cask "alacritty"
cask "iterm2"
cask "gitup"
# cask "sublime-merge"
# cask "pritunl"
# cask "rancher"
cask "docker"
# brew "docker-buildx"
# brew "colima"
# brew "docker-credential-helper-ecr"
brew "dive"
# brew "trivy"
# cask "virtualbox"
# cask "vagrant"
# cask "aws-vault"
# cask "telegram"
# cask "zoom"
# cask "skype"
cask "visual-studio-code"
# cask "intellij-idea"
# cask "jetbrains-gateway"
# cask "tableplus"
cask "dbeaver-community"
# cask "postman"
# cask "nrlquaker-winbox"
# cask "crunch"
cask "vitals"
# cask "microsoft-edge"
cask "skype"
# cask "intellij-idea"
# cask "temurin"
cask "wireshark"
# cask "clickhouse"
# cask "firefox"

cask "zoom"
cask "openwebstart"
cask "microsoft-teams"

# cask "datagrip"

# scala
brew "coursier"
brew "luarocks"

tap "homebrew/cask-fonts"
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-go-mono-nerd-font"
